"use strict";

// console.log('Текст из script.js!');

// Задание 2:
// 1. Создайте переменную `num` и присвойте ей значение `123`. Выведите значение этой переменной в консоль.

// const num = 123;
// console.log(num);

// 2. Создайте переменную `а` и присвойте ей значение `5`, переопределите переменную `а` на значение `7`, выведите переменную `а` в консоль.

// let a = 5;
// a = 7;
// console.log(a);

// 3. Создайте переменную `b`. Запишите в нее сумму чисел `1`, `2` и `3`. С помощью функции `console.log` выведите в консоль содержимое переменной `b`.

// const b = 1 + 2 + 3;
// console.log(b);

// 4. Создайте два вида комментариев в вашем коде, добавьте в них произвольный текст.

// const b = 1 + 2 + 3;
// console.log(b);

/*const b = 1 + 2 + 3 new comment
console.log(b) and */

// Тайминг: 20 минут.

// Задание 3:
// 1. Создайте две переменные, одна будет хранить ваш возраст (девушкам всегда 18), а другая переменная будет хранить текущий год (все созданные переменные должны быть логично названы).
// - Создайте переменную суммы и присвойте сумму чисел из двух переменных.
// - Создайте переменную разности и присвойте разность текущего года и вашего возраста.
// - Создайте переменную произведения и присвойте произведение чисел двух переменных.
// - Создайте переменную частного и присвойте деление чисел текущего года к вашему возрасту.

// const myAge = 37;
// const currentYear = 2023;
// const sum = myAge + currentYear;
// const diff = currentYear - myAge;
// const mult = myAge * currentYear;
// const div = currentYear / myAge;

// 2. Выведите в консоль все созданные переменные.

// console.log(myAge, currentYear, sum, diff, mult, div);

// 3. Сложите все созданные переменные и выведите результат в консоль.

// console.log(myAge + currentYear + sum + diff + mult + div);

// Тайминг: 20 минут.

// Задание 4:
// Не запуская код, определите, что отобразится в консоли:
// let a = 5 + 5 * 3 + 3;
// console.log(a);
// Ответ: 23.
// Не запуская код, определите, что отобразится в консоли:
// let b = 8 / 2 + 2;
// console.log(b);
// Ответ: 6.
// Не запуская код, определите, что отобразится в консоли:
// let c = (2 + 3) * (2 + 3);
// console.log(c);
// Ответ: 25.
// Не запуская код, определите, что отобразится в консоли:
// let d = (2 + 3) * 2 + 3;
// console.log(d);
// Ответ: 13.
// Не запуская код, определите, что отобразится в консоли:
// let e = (2 * 8) / 4;
// console.log(e);
// Ответ: 4.
// Не запуская код, определите, что отобразится в консоли:
// let f = 2 * (8 / 4);
// console.log(f);
// Ответ: 4.
// Тайминг: 20 минут.

// Задание 5:
// 1. Запишите в переменную `a` число `0.1`, а в переменную `b` - число `0.2`. Найдите сумму значений этих переменных и выведите ее на экран.

// const a = 0.1;
// const b = 0.2;
// const sum = a + b;
// console.log(sum);

// const num = 10.543;

// console.log(num);
// console.log(Math.round(num)); // округляет до целого согласно математике
// console.log(Math.floor(num)); // вниз
// console.log(Math.ceil(num)); // вверх
// console.log(Math.trunc(num)); // отбрасывает дробную часть
// console.log(num.toFixed(2)); // возвращает строку с округлением до двух знаков после запятой
// console.log(+num.toFixed(2)); // унарный плюс превращает строку в число
// console.log(Number(num.toFixed(2)));
// console.log(Math.round(num * 100) / 100); // лучший вариант для округления (округлили до двух значений после точки)

// 2. Создайте переменную `c`, запишите в нее какое-нибудь положительное или отрицательное число. Выведите на экран это число с обратным знаком.

// const num = 5;
// console.log(-num);

// Тайминг: 5 минут.

// Задание 6:
// 1. Создайте строку с вашем именем и строку с вашей фамилией. Выведите эти данные в консоль.

// const firstName = "Dima";
// const lastName = "Putov";
// console.log(firstName, lastName);

// 2. Создайте переменную с текстом 'java' и переменную с текстом 'script'. С помощью этих переменных и операции конкатенации строк выведите в консоль строку 'javascript'.

// const java = "java";
// const script = "script";
// console.log(java + script);

// 3. Создайте переменную с текстом 'hello' и переменную с текстом 'world'. С помощью этих переменных и операции конкатенации строк выведите в консоль строку 'hello world', желательно использовать бэктики (обратные кавычки).

// const hello = "hello";
// const world = "world";
// console.log(`${hello} ${world}!`);

// Тайминг: 15 минут.
